"durationDisplayPattern" = "%{value1}@ seconds"; // Used in XIB

"allowGUIScriptingTitle" = "Allow GUI Scripting access to Little Snitch";
"allowGUIScriptingDetail" = "GUI Scripting is a security risk because it allows remote control of Little Snitch.";

"allowScriptingAdditionsTitle" = "Allow Scripting Additions";
"allowScriptingAdditionsDetail" = "Scripting Additions are a security risk because they inject third-party code into Little Snitch.";

"codeInjectionTitle" = "Enable Code Injection Alert";
"codeInjectionDetail" = "Code injection is a security risk because it allows unprivileged applications to execute arbitrary program code in the context of any other application.";

"ruleDetailLevelTitle" = "Detail Level";
"ruleDetailLevelDetail" = "Allows non-expert users to hide technical terms and options like ports and protocols from being shown in the connection alert window.";
"ruleDetailLevelFullTitle" = "Show Full Details";
"ruleDetailLevelMediumTitle" = "Hide Protocol Details";
"ruleDetailLevelMinimumTitle" = "Hide Protocol and Port Details";

"confirmWithReturnTitle" = "Confirm with Return and Escape";
"confirmWithReturnDetail" = "Turn off this option to avoid accidental confirmation of\nthe Little Snitch alert. You can still confirm the alert with\n⌘-Return and ⌥-Return.";

"smartRuleSuggestionTitle" = "Smart Rule Suggestion";
"smartRuleSuggestionDetail" = "The suggested rule depends on the program that triggered the connection attempt.";

"statusInfoOff" = "Click Start to prevent network communication based on your custom set of rules.";
"statusInfoOn" = "Click Stop to allow any network communication.";

"invalidLicenseInfoFormat %@" = "The license with the serial number %@ is invalid.\nThe network filter will be turned off after 3 hours of operation.";
"notRegisteredInfo" = "Little Snitch currently runs in demo mode.\nThe network filter will be turned off after 3 hours of operation.";

"simulatedKeystrokeIgnoredFromAppFormat %@" = "Simulated keystrokes from %@ have been ignored.";
"simulatedKeystrokeIgnoredFromPIDFormat %li" = "Simulated keystrokes from process with PID %li have been ignored.";
"simulatedKeystrokeIgnoredFromUnknown" = "Simulated keystrokes have been ignored.";
"simulatedKeystrokeIgnoredSuffix" = "To accept them, “GUI Scripting access to Little Snitch” must be allowed in the Security preferences.";

"createUnapprovedRulesTitle" = "Mark rules from connection alert as unapproved";
"createUnapprovedRulesDetail" = "New rules that have been created via connection alert are marked as unapproved. They show up with a blue dot in the Rules window.";

"autoApproveTitle" = "Approve rules automatically";
"autoApproveDetail" = "Selecting an unapproved rule in the Rules window approves this rule automatically. Turn off this option if you want to approve rules manually with ⌘K";

"automaticProfileSwitchingTitle" = "Enable automatic profile switching";
"automaticProfileSwitchingDetail" = "When joining a known network, an associated profile will be activated automatically.";
"automaticProfileSwitchingActionTitle" = "When joining an unknown network:";

"automaticProfileSwitchingSaveGeoLocationTitle" = "Save geolocations of networks";
"automaticProfileSwitchingSaveGeoLocationDetail" = "When joining a new network, its geographic location will be determined so it can be marked on a map later.";

"runningInDemoModeInfo" = "Little Snitch currently runs in demo mode. The network filter will be turned off after 3 hours of operation.";

"allowGlobalEditingTitle" = "Allow Global Rule Editing";
"allowGlobalEditingDetail" = "Allows the creation and modification of global rules that are valid for all users.";

"allowRuleAndProfileEditingTitle" = "Allow Rule and Profile Editing";
"allowRuleAndProfileEditingDetail" = "Turn this option off to prevent unauthorized users from modifying rules and profiles.";

"allowProfileSwitchingTitle" = "Allow Profile Switching";
"allowProfileSwitchingDetail" = "Turn this option off to prevent unauthorized users from changing the currently active profile.";

"allowPreferencesEditingTitle" = "Allow Preferences Editing";
"allowPreferencesEditingDetail" = "Turn this option off to prevent unauthorized users from changing Little Snitch preferences.";

"respectPrivacyOfOtherUsersTitle" = "Respect privacy of other users";
"respectPrivacyOfOtherUsersDetail" = "Prevents the display of connection destinations from other users in Network Monitor.";

"expiringLicenseTitle" = "Expiring Demo License";
"singleLicenseTitle" = "Single License";
"multiLicenseTitleFormat %d" = "Multi License (%d×)";
"familyLicenseTitle" = "Family License (up to 5 computers)";
"siteLicenseTitle" = "Site License";

"expiringLicenseInfoFormat %@" = "Expires on %@";
"expiredLicenseInfoFormat %@" = "Expired on %@";

"_upgradeAlertMessageText" = "You have entered an old license key.";
"_upgradeAlertInformativeText" = "The entered license is valid for a previous version of Little Snitch only. An upgrade to Little Snitch 3 is required to run this version of Little Snitch.";

"inactivityWarningCheckbox" = "Show inactivity warning in menu bar";
"inactivityWarningToolTip" = "Shows a warning sign in the menu bar when the Network Filter is off.";

"showMonitorInMenuBarIneffectiveWarningToolTip" = "This setting is currently ineffective because the status is not shown in the menu bar. The status display can be turned on via “General → Show status in menu bar”.";

"infiniteMonitorCapacityWarningToolTip" = "Unlimited capacity can cause a large memory consumption of Network Monitor.";

"monitorDemoIsExpiredMessage" = "The 30 day demo version has expired!";
